load-test/rayon_1000_20000
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /v1/cloud-config/validate
Document Length:        246 bytes

Concurrency Level:      1000
Time taken for tests:   1.119 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      7100000 bytes
Total body sent:        5260000
HTML transferred:       4920000 bytes
Requests per second:    17875.10 [#/sec] (mean)
Time per request:       55.944 [ms] (mean)
Time per request:       0.056 [ms] (mean, across all concurrent requests)
Transfer rate:          6196.93 [Kbytes/sec] received
                        4590.97 kb/s sent
                        10787.90 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   49 209.3      3    1056
Processing:     3    6   5.9      4      40
Waiting:        0    4   3.3      3      32
Total:          5   54 214.0      7    1096

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      8
  80%      8
  90%     17
  95%     38
  98%   1061
  99%   1073
 100%   1096 (longest request)