load-test/rayon_1000_200000.log
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /v1/cloud-config/validate
Document Length:        158 bytes

Concurrency Level:      1000
Time taken for tests:   10.025 seconds
Complete requests:      200000
Failed requests:        0
Total transferred:      53400000 bytes
Total body sent:        54600000
HTML transferred:       31600000 bytes
Requests per second:    19949.18 [#/sec] (mean)
Time per request:       50.127 [ms] (mean)
Time per request:       0.050 [ms] (mean, across all concurrent requests)
Transfer rate:          5201.59 [Kbytes/sec] received
                        5318.48 kb/s sent
                        10520.08 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   24   3.3     24      38
Processing:     6   26   3.5     26      48
Waiting:        1   19   3.3     18      35
Total:         22   50   2.0     50      71

Percentage of the requests served within a certain time (ms)
  50%     50
  66%     50
  75%     51
  80%     51
  90%     52
  95%     54
  98%     55
  99%     56
 100%     71 (longest request)